app/views/home/index.html.erb

SELECT "restaurants".* FROM "restaurants"
---
   <div class="restaurants">
      <% Restaurant.all.each do |restaurant| %>