app/views/dishes/show.html.erb

SELECT "reviews".* FROM "reviews"
---
<div class="restaurants">
  <% Review.all.each do |review| %>