app/views/restaurants/show.html.erb

SELECT "dishes".* FROM "dishes"
---
<div class="restaurants">
  <% Dish.all.each do |dish| %>

SELECT "comments".* FROM "comments"
---
<div class="restaurants">
  <% Comment.all.each do |comment| %>