app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.restaurant_id = @restaurant.id
    @comment.user_id = current_user.id

    if @comment.save
---
INSERT INTO "comments" ("body", "date", "created_at", "updated_at", "user_id", "restaurant_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "El mejor sitio de la vida"], ["date", "2019-10-17"], ["created_at", "2019-10-17 06:02:50.907160"], ["updated_at", "2019-10-17 06:02:50.907160"], ["user_id", 69], ["restaurant_id", 68]]

    def find_restaurant
      @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]