app/controllers/dishes_controller.rb

  def create
    @dish = Dish.new(dish_params)
    @dish.restaurant_id = @restaurant.id

    if @dish.save
---
INSERT INTO "dishes" ("name", "price", "description", "quantity", "rating", "created_at", "updated_at", "restaurant_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @dish.destroy
---
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 4]]

    def find_restaurant
      @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]