app/controllers/orders_controller.rb

INSERT INTO "orders" ("price", "payment", "delivery_address", "delivery_time", "status", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save