app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "mail", "address", "rating", "phone", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    @restaurant.user_id = current_user.id

    if @restaurant.save

UPDATE "restaurants" SET "rating" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["rating", 6.0], ["updated_at", "2019-10-17 02:05:01.534916"], ["id", 69]]
---
  def update
    if @restaurant.update(restaurant_params)