app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("body", "dish_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hola"], ["dish_id", 3], ["user_id", 69], ["created_at", "2019-10-17 05:35:17.516035"], ["updated_at", "2019-10-17 05:35:17.516035"]]
---
  def create
    @review = Review.new(review_params)
    @review.dish_id = @dish.id
    @review.user_id = current_user.id

    if @review.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
---
    def find_restaurant
      @restaurant = Restaurant.find(params[:restaurant_id])

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def find_dish
      @dish = Dish.find(params[:dish_id])